user-4.1/tutorials/multiPhysics/interTrackEddyCurrentFoam/amf3D/constant/region_fluid_faSubMesh/faMesh/faMeshDefinition
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/faMesh";
    object      faMeshDefinition;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

polyMeshPatches 1 ( triangulatedFaces );

boundary
{
    sideWall
    {
        type            patch;
        ownerPolyPatch  triangulatedFaces;
        neighbourPolyPatch sideWall;
    }
}


// ************************************************************************* //
