user-4.1/tutorials/multiPhysics/interTrackEddyCurrentFoam/amf3D/0.org/region_fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    trackedSurface
    {
        type            fixedGradient;
        gradient        uniform (0 0 0);
    }
    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    sideWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    "procBoundary.*"
    {
        type            processor;
        value           $internalField;
    }
}

// ************************************************************************* //
