user-4.1/tutorials/multiPhysics/interTrackEddyCurrentFoam/amf3D/system/region_fluid_carrierMeshSubset/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(Ax|Ay|Az)"
    {
        solver          BiCGStab;
        tolerance       1e-08;
        relTol          0.1;
        minIter         0;
        maxIter         300;
        preconditioner  Cholesky;
    }
}

EDDYCURRENT
{
    interface       "conductorSurface";
    nCorrectors     10;
    nSubCorrectors  100;
    residualControl
    {
        "(Ax|Ay|Az)"
        {
            tolerance       1e-05;
            relTol          0.01;
        }
        "(VRe|VIm)"
        {
            tolerance       1e-05;
            relTol          0.01;
        }
    }
    emUpdate
    {
        enabled         yes;
        outputTimeIndexCycle 10;
        timeIndexCycle  2147483647;
        timeCycle       1e+300;
        relDeltaAmax    0.1;
    }
}

relaxationFactors
{
}


// ************************************************************************* //
